Revit 2027 API
DetailFailures Properties
The BuiltInFailures.DetailFailures type exposes the following members.
Properties
Name | Description
EavesAreAligned |  All eaves are already aligned.
NeedsTwoToAlignEaves |  At least two Slope Defining Lines are needed to perform Align Eaves.
RepeatingDetailSpacingZeroError |  Spacing must be greater than 0
Top
See Also
Reference
BuiltInFailures.DetailFailures Class
Autodesk.Revit.DB Namespace